<template>
  <!-- 第一个 停电检测 -->
  <div>
    <dv-scroll-board
                  :config="table"
                  style="width: 100%; height: 280px"
                />
  </div>
</template>

<script setup lang="ts">
import {  ref } from 'vue';
const table = ref();

// 示例数据
table.value = {
  headerHeight: 50,
  headerBGC:'rgba(14,183,221,0.8)',
  oddRowBGC:'rgba(14,183,221,0.3)',
  evenRowBGC:'rgba(14,183,221,0.4)',
  header: [
    "姓名",
    "学号",
    "学院",
    "宿舍号",
    "床铺号",
    "出入",
    "时间"
  ],
  data: [
    {
      姓名: "张三",
      学号: "2022302131095",
      学院: "遥感信息工程学院",
      宿舍号: "101",
      床铺: "3",
      出入: "离开",
      时间: "2022-03-10 10:00:00",
    },
    {
      姓名: "张三",
      学号: "2022302131095",
      学院: "遥感信息工程学院",
      宿舍号: "101",
      床铺: "3",
      出入: "离开",
      时间: "2022-03-10 10:00:00",
    },
    {
      姓名: "张三",
      学号: "2022302131095",
      学院: "遥感信息工程学院",
      宿舍号: "101",
      床铺: "3",
      出入: "离开",
      时间: "2022-03-10 10:00:00",
    },
    {
      姓名: "张三",
      学号: "2022302131095",
      学院: "遥感信息工程学院",
      宿舍号: "101",
      床铺: "3",
      出入: "离开",
      时间: "2022-03-10 10:00:00",
    },
    {
      姓名: "张三",
      学号: "2022302131095",
      学院: "遥感信息工程学院",
      宿舍号: "101",
      床铺: "3",
      出入: "离开",
      时间: "2022-03-10 10:00:00",
    },
    {
      姓名: "张三",
      学号: "2022302131095",
      学院: "遥感信息工程学院",
      宿舍号: "101",
      床铺: "3",
      出入: "离开",
      时间: "2022-03-10 10:00:00",
    },
    // ...其他数据行
  ],
};
</script>